# Series Data Structure

In [3]:
import pandas as pd

In [5]:
pd.Series?

In [7]:
animals=["Tiger","Bear","Moose"]
pd.Series(animals)

0    Tiger
1     Bear
2    Moose
dtype: object

In [9]:
numbers=[1,2,3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [17]:
sports= {"Basketball":"USA",
        "Futball": "Brazil",
         "Baseball":"Cuba",
         "Kungfu":"China"}  
s=pd.Series(sports)
s

Basketball       USA
Futball       Brazil
Baseball        Cuba
Kungfu         China
dtype: object

In [18]:
s.index

Index(['Basketball', 'Futball', 'Baseball', 'Kungfu'], dtype='object')

# Quering a Series

In [20]:
s.iloc[3]

'China'

In [21]:
s[3]

'China'

In [22]:
s.loc["Basketball"]

'USA'

In [26]:
sports={99:"Mexico",
       100:"Guatemala",
       101:"Belize",
        102:"Colombia"
       }
s=pd.Series(sports)

In [27]:
s[0]

KeyError: 0

In [28]:
s.iloc[0]

'Mexico'

In [30]:
s.loc[100]

'Guatemala'

In [34]:
s[0]

KeyError: 0

In [35]:
p = pd.Series([100.00, 120.00, 101.00, 3.00])
p

0    100.0
1    120.0
2    101.0
3      3.0
dtype: float64

In [36]:
total=0
for item in p:
    total+=item
print(total)

324.0

In [37]:
import numpy as np

total=np.sum(p)
print(total)

324.0

In [41]:
#create large amount of random numbers
p=pd.Series(np.random.randint(0,1000,10000))
#head print only the first ones
p.head()

0    372
1    916
2    745
3    455
4    687
dtype: int64

In [43]:
#lenght of series
len(p)

10000

In [45]:
%%timeit -n 100
summary = 0
for item in p:
    summary+=item

548 µs ± 67.4 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [46]:
%%timeit -n 100
summary = np.sum(s)

107 µs ± 31.9 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [47]:
%%timeit -n 100
summary = np.sum(p)

129 µs ± 31 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [50]:
p+=1 #adds two to each item in s using broadcasting
p.head()

0    377
1    921
2    750
3    460
4    692
dtype: int64

In [53]:
#loop to add a 2 to each number of the series
for label, value in p.iteritems():
    p.set_value(label, value+2)
p.head()

/home/tona/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:2: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead

0    383
1    927
2    756
3    466
4    698
dtype: int64

In [55]:
s = pd.Series([1, 2, 3])
s.loc['Animal'] = 'Bears'
s

0             1
1             2
2             3
Animal    Bears
dtype: object

In [56]:
print(s)

0             1
1             2
2             3
Animal    Bears
dtype: object

In [57]:
original_sports = pd.Series({'Archery': 'Bhutan',
                             'Golf': 'Scotland',
                             'Sumo': 'Japan',
                             'Taekwondo': 'South Korea'})
cricket_loving_countries = pd.Series(['Australia',
                                      'Barbados',
                                      'Pakistan',
                                      'England'], 
                                   index=['Cricket',
                                          'Cricket',
                                          'Cricket',
                                          'Cricket'])
all_countries = original_sports.append(cricket_loving_countries)

In [58]:
original_sports

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [59]:
cricket_loving_countries

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

In [60]:
all_countries

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

In [61]:
all_countries.loc['Cricket']

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

In [64]:
phds=pd.Series({"AlexD": "HD",
               "Julius":"DA",
               "Tona":"HD",
               "Steffen":"DA",
               "Edgar":"F"})

In [65]:
phds

AlexD      HD
Julius     DA
Tona       HD
Steffen    DA
Edgar       F
dtype: object

In [67]:
newphds=pd.Series({"Lukas":"HD",
                 "Sebastian":"HD",
                 "Michael":"DA"})

In [68]:
newphds

Lukas        HD
Sebastian    HD
Michael      DA
dtype: object

In [70]:
all_phds= phds.append(newphds)
all_phds

AlexD        HD
Julius       DA
Tona         HD
Steffen      DA
Edgar         F
Lukas        HD
Sebastian    HD
Michael      DA
dtype: object

In [178]:
all_phds.loc["Lukas"]

'HD'

In [107]:
#enumerate the students
print("Only HD students selected")
for idx,val in enumerate(all_phds):
#    if uni=="HD":
        print("University, Stud:",idx, val)
#        print("Student:",all_phds.loc[uni])

Only HD students selected
University, Stud: 0 HD
University, Stud: 1 DA
University, Stud: 2 HD
University, Stud: 3 DA
University, Stud: 4 F
University, Stud: 5 HD
University, Stud: 6 HD
University, Stud: 7 DA

In [167]:
#enumerate the students
print("Only HD students selected")
for uni in all_phds:
    if uni=="HD":
        print("University, Stud:",uni)
#        print("Student:",all_phds.loc[uni])
    else: continue

Only HD students selected
University, Stud: HD
University, Stud: HD
University, Stud: HD
University, Stud: HD

# The data frame structure

In [228]:
import pandas as pd

purchase_1 = pd.Series({"Name":"Chris",
                        "Item Purchased":"Dog food",
                        "Cost":22.50})
purchase_2 = pd.Series({"Name":"Kevin",
                        "Item Purchased":"Kitty Litter",
                        "Cost":2.50})
purchase_3 = pd.Series({"Name":"Vinod",
                        "Item Purchased":"Bird seed",
                       "Cost":5.00})
df=pd.DataFrame([purchase_1, purchase_2, purchase_3],index=["Store 1","Store 1","Store 2"])
df.head()

          Name Item Purchased  Cost
Store 1  Chris       Dog food  22.5
Store 1  Kevin   Kitty Litter   2.5
Store 2  Vinod      Bird seed   5.0

In [229]:
df.loc["Store 2"]

Name                  Vinod
Item Purchased    Bird seed
Cost                      5
Name: Store 2, dtype: object

In [230]:
type(df.loc["Store 2"])

pandas.core.series.Series

In [231]:
df.loc["Store 1"]

          Name Item Purchased  Cost
Store 1  Chris       Dog food  22.5
Store 1  Kevin   Kitty Litter   2.5

In [232]:
#For the purchase records from the pet store
#How would you get a list of all items which had been purchased
#(regardless of where they might have been purchased, or by whom)?

print (df["Item Purchased"])

Store 1        Dog food
Store 1    Kitty Litter
Store 2       Bird seed
Name: Item Purchased, dtype: object

In [233]:
df.loc['Store 1']

          Name Item Purchased  Cost
Store 1  Chris       Dog food  22.5
Store 1  Kevin   Kitty Litter   2.5

In [234]:
df.loc['Store 1', 'Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [235]:
df.T

                 Store 1       Store 1    Store 2
Name               Chris         Kevin      Vinod
Item Purchased  Dog food  Kitty Litter  Bird seed
Cost                22.5           2.5          5

In [236]:
#not recommended to use this chain, it produces a copy of the data
df.loc['Store 1']['Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [237]:
df.loc[:,["Name","Cost"]]

          Name  Cost
Store 1  Chris  22.5
Store 1  Kevin   2.5
Store 2  Vinod   5.0

In [238]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog food  22.5
Store 1  Kevin   Kitty Litter   2.5
Store 2  Vinod      Bird seed   5.0

In [239]:
df.drop("Store 1")

          Name Item Purchased  Cost
Store 2  Vinod      Bird seed   5.0

In [240]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog food  22.5
Store 1  Kevin   Kitty Litter   2.5
Store 2  Vinod      Bird seed   5.0

In [241]:
copy_df =df.copy()
copy_df = copy_df.drop("Store 1")
copy_df

          Name Item Purchased  Cost
Store 2  Vinod      Bird seed   5.0

In [189]:
copy_df.drop?

In [242]:
del copy_df["Name"]
copy_df

        Item Purchased  Cost
Store 2      Bird seed   5.0

In [1]:
df["Location"]=None

NameError: name 'df' is not defined

In [244]:
df

          Name Item Purchased  Cost Location
Store 1  Chris       Dog food  22.5     None
Store 1  Kevin   Kitty Litter   2.5     None
Store 2  Vinod      Bird seed   5.0     None

In [245]:
#df["Cost"]*=0.8
#making a copy and adding it at the end
discount_df = df.copy()
discount_df = df.loc[:,["Cost"]]
discount_df = discount_df*0.8
df["Discount price"]=discount_df
print(df)

          Name Item Purchased  Cost Location  Discount price
Store 1  Chris       Dog food  22.5     None            18.0
Store 1  Kevin   Kitty Litter   2.5     None             2.0
Store 2  Vinod      Bird seed   5.0     None             4.0

# My own example of data frames

In [2]:
import pandas as pd

In [3]:
student_1 =pd.Series ({"Name":"Julius",
                    "University":"DA",
                    "Topic":"Spectra",
                      "Age":30})
student_2 =pd.Series({"Name":"Tona",
                    "University":"HD",
                    "Topic":"JPsi",
                     "Age":29})
student_3=pd.Series({"Name":"Steffen",
                    "University":"DA",
                    "Topic":"JPsi",
                    "Age":30})
student_4=pd.Series({"Name":"Michael",
                    "University":"DA",
                    "Topic":"Nuclei",
                    "Age":27})
phds=pd.DataFrame([student_1,student_2,student_3,student_4],index=["De","Mx","De","De"])
phds

       Name University    Topic  Age
De   Julius         DA  Spectra   30
Mx     Tona         HD     JPsi   29
De  Steffen         DA     JPsi   30
De  Michael         DA   Nuclei   27

In [4]:
phds["Age"] < 30.

De    False
Mx     True
De    False
De     True
Name: Age, dtype: bool

In [5]:
only_old=phds.where(phds["Age"] > 29)
only_old.head()

       Name University    Topic   Age
De   Julius         DA  Spectra  30.0
Mx      NaN        NaN      NaN   NaN
De  Steffen         DA     JPsi  30.0
De      NaN        NaN      NaN   NaN

In [6]:
old.count()
phds.loc[:,["Name","University"]]

NameError: name 'old' is not defined

In [7]:
phds["Name"][phds["Topic"]=="JPsi"]

Mx       Tona
De    Steffen
Name: Name, dtype: object

In [8]:
phds

       Name University    Topic  Age
De   Julius         DA  Spectra   30
Mx     Tona         HD     JPsi   29
De  Steffen         DA     JPsi   30
De  Michael         DA   Nuclei   27

In [9]:
len(phds[phds["University"]=="DA"])

3

In [10]:
len(phds[phds["University"]=="HD"])

1

In [11]:
len(phds[phds["University"]=="DA"])+ len(phds[phds["University"]=="HD"])

4

# Indexing dataframes

In [12]:
#copy the index into a new column
phds["Nationality"]= phds.index

In [13]:
#assign the columns as index
phds=phds.set_index("University")
phds.head()

               Name    Topic  Age Nationality
University
DA           Julius  Spectra   30          De
HD             Tona     JPsi   29          Mx
DA          Steffen     JPsi   30          De
DA          Michael   Nuclei   27          De

In [14]:
#reset index number
phds=phds.reset_index()
phds

  University     Name    Topic  Age Nationality
0         DA   Julius  Spectra   30          De
1         HD     Tona     JPsi   29          Mx
2         DA  Steffen     JPsi   30          De
3         DA  Michael   Nuclei   27          De

In [15]:
phds["University"].unique()
phds=phds[phds["University"]=="DA"]
phds

  University     Name    Topic  Age Nationality
0         DA   Julius  Spectra   30          De
2         DA  Steffen     JPsi   30          De
3         DA  Michael   Nuclei   27          De

In [16]:
columns_to_keep=["University",
                "Name",
                "Topic",
                "Age"]
phds=phds[columns_to_keep]
phds
phds=phds.set_index(["University","Topic"])
phds

                       Name  Age
University Topic
DA         Spectra   Julius   30
           JPsi     Steffen   30
           Nuclei   Michael   27

In [21]:
phds.loc["DA","JPsi"]

Name    Steffen
Age          30
Name: (DA, JPsi), dtype: object

In [18]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [19]:
purchase_4=pd.Series({"Name":"Kevin",
                    "Item Purchased":"Kitty Food",
                    "Cost":3.0},)
df2=pd.DataFrame([purchase_4],index=["Store 2"])
df=df.append(df2)
df            
df['Location'] = df.index
df
df=df.set_index(["Location","Name"])
df

               Item Purchased  Cost
Location Name
Store 1  Chris       Dog Food  22.5
         Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0
         Kevin     Kitty Food   3.0

# Assignment 2